
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |    Change |   🔴 Destroy |
|:---------:|--------:|----------:|------------:|
|     ✅     |       1 |         0 |           3 |
## Affected resources by action

|  Action  | Resources                                                                                                   |
|:--------:|:------------------------------------------------------------------------------------------------------------|
|    🟢     | `aws_secretsmanager_secret.github_token`                                                                    |
|    🔴     | `aws_iam_policy.github_runner_permissions`                                                                  |
|    🔴     | `aws_secretsmanager_secret.runner_token_secret`                                                             |
|    🔴     | `module.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.extra["github_runner_permissions"]` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_iam_policy.github_runner_permissions will be destroyed
  # (because aws_iam_policy.github_runner_permissions is not in configuration)
  - resource "aws_iam_policy" "github_runner_permissions" {
      - arn         = "arn:aws:iam::493370826424:policy/github_runner_permissions" -> null
      - description = "Policy that allows to manage github runner token" -> null
      - id          = "arn:aws:iam::493370826424:policy/github_runner_permissions" -> null
      - name        = "github_runner_permissions" -> null
      - path        = "/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "secretsmanager:*"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:us-west-1:493370826424:secret:runner_token_secret-cR6wCa"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPAXFXZRL24HMAVSLWDZ" -> null
      - tags        = {} -> null
      - tags_all    = {
          - "created_by"  = "infrahouse/aws-control-493370826424"
          - "environment" = "production"
        } -> null
    }

  # aws_secretsmanager_secret.github_token will be created
  + resource "aws_secretsmanager_secret" "github_token" {
      + arn                            = (known after apply)
      + description                    = "GitHub token with manage_runners:org permissions. Needed to register self-hosted runners."
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "GITHUB_TOKEN"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
    }

  # aws_secretsmanager_secret.runner_token_secret will be destroyed
  # (because aws_secretsmanager_secret.runner_token_secret is not in configuration)
  - resource "aws_secretsmanager_secret" "runner_token_secret" {
      - arn                            = "arn:aws:secretsmanager:us-west-1:493370826424:secret:runner_token_secret-cR6wCa" -> null
      - description                    = "Token to register a GitHub Actions runner." -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:runner_token_secret-cR6wCa" -> null
      - name                           = "runner_token_secret" -> null
      - recovery_window_in_days        = 0 -> null
      - tags                           = {} -> null
      - tags_all                       = {
          - "created_by"  = "infrahouse/aws-control-493370826424"
          - "environment" = "production"
        } -> null
    }

  # module.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.extra["github_runner_permissions"] will be destroyed
  # (because key ["github_runner_permissions"] is not in for_each map)
  - resource "aws_iam_role_policy_attachment" "extra" {
      - id         = "jumphost-Zv01ElhajbB620240223005112032800000005-20240327230528435100000001" -> null
      - policy_arn = "arn:aws:iam::493370826424:policy/github_runner_permissions" -> null
      - role       = "jumphost-Zv01ElhajbB620240223005112032800000005" -> null
    }

Plan: 1 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDEsICJjaGFuZ2UiOiAwLCAiZGVzdHJveSI6IDN9fQ==
```
</details>